export default {
  COLORS: {
    // Основные цвета
    DEFAULT: '#DCDCDC',           // Цвет по умолчанию, часто используется для фона
    PRIMARY: '#9C26B0',           // Основной цвет приложения, используется для основных элементов
    LABEL: '#FE2472',             // Цвет для меток и тегов
    INFO: '#00BCD4',              // Информационный цвет, используется для сообщений и уведомлений
    ERROR: '#F44336',             // Цвет ошибок, используется для сообщений об ошибках и предупреждений
    SUCCESS: '#4CAF50',           // Цвет успеха, используется для подтверждений и успешных операций
    WARNING: '#FF9800',           // Предупреждающий цвет, используется для предупреждений и уведомлений
    MUTED: '#979797',             // Приглушенный цвет, используется для неактивных элементов
    INPUT: '#DCDCDC',             // Цвет для полей ввода
    ACTIVE: '#9C26B0',            // Цвет активных элементов
    BUTTON_COLOR: '#9C26B0',      // Цвет кнопок
    PLACEHOLDER: '#9FA5AA',       // Цвет заполнителей (placeholder) в полях ввода
    SWITCH_ON: '#9C26B0',         // Цвет переключателя в состоянии "включено"
    SWITCH_OFF: '#D4D9DD',        // Цвет переключателя в состоянии "выключено"
    GRADIENT_START: '#6B24AA',    // Начальный цвет градиента
    GRADIENT_END: '#AC2688',      // Конечный цвет градиента
    PRICE_COLOR: '#EAD5FB',       // Цвет для отображения цен
    BORDER_COLOR: '#E7E7E7',      // Цвет границ элементов
    BLOCK: '#E7E7E7',             // Цвет блоков или карточек
    ICON: '#4A4A4A',              // Цвет иконок
  },
  SIZES: {
    BLOCK_SHADOW_RADIUS: 2,       // Радиус тени для блоков и карточек
  }
};
